Masmiseim36/nxpSDK/boards/frdmke15z/demo_apps/mc_bldc/pin_mux.h
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTB12 (number 68), J3[15]/MC_PWM_AT
  @{ */
#define PINTOOL_PWM_MC_PWM_AT_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_PWM_MC_PWM_AT_PIN 12U    /*!<@brief PORTB pin index: 12 */
                                         /* @} */

/*! @name PORTB13 (number 67), J3[13]/J6[8]/MC_PWM_AB/RF_GPIO_IRQ
  @{ */
#define PINTOOL_PWM_MC_PWM_AB_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_PWM_MC_PWM_AB_PIN 13U    /*!<@brief PORTB pin index: 13 */
                                         /* @} */

/*! @name PORTB14 (number 66), J3[11]/J6[5]/MC_PWM_BT/RF_SPI1_SCK
  @{ */
#define PINTOOL_PWM_MC_PWM_BT_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_PWM_MC_PWM_BT_PIN 14U    /*!<@brief PORTB pin index: 14 */
                                         /* @} */

/*! @name PORTB15 (number 65), J3[9]/J6[7]/MC_PWM_BB/RF_SPI1_SIN
  @{ */
#define PINTOOL_PWM_MC_PWM_BB_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_PWM_MC_PWM_BB_PIN 15U    /*!<@brief PORTB pin index: 15 */
                                         /* @} */

/*! @name PORTB16 (number 64), J3[7]/J6[6]/MC_PWM_CT/RF_SPI1_SOUT
  @{ */
#define PINTOOL_PWM_MC_PWM_CT_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_PWM_MC_PWM_CT_PIN 16U    /*!<@brief PORTB pin index: 16 */
                                         /* @} */

/*! @name PORTB17 (number 63), J3[5]/J6[4]/MC_PWM_CB/RF_SPI1_PCS3
  @{ */
#define PINTOOL_PWM_MC_PWM_CB_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_PWM_MC_PWM_CB_PIN 17U    /*!<@brief PORTB pin index: 17 */
                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_PWM(void);

/*! @name PORTD3 (number 70), SW3
  @{ */
#define PINTOOL_MISC_SW3_FGPIO FGPIOD /*!<@brief FGPIO device name: FGPIOD */
#define PINTOOL_MISC_SW3_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define PINTOOL_MISC_SW3_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_MISC_SW3_PIN 3U     /*!<@brief PORTD pin index: 3 */
                                    /* @} */

/*! @name PORTD0 (number 4), D4[1]/RGB_RED
  @{ */
#define PINTOOL_MISC_LED_RED_FGPIO FGPIOD /*!<@brief FGPIO device name: FGPIOD */
#define PINTOOL_MISC_LED_RED_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define PINTOOL_MISC_LED_RED_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_MISC_LED_RED_PIN 0U     /*!<@brief PORTD pin index: 0 */
                                        /* @} */

/*! @name PORTD16 (number 21), D4[4]/RGB_GREEN
  @{ */
#define PINTOOL_MISC_LED_GREEN_FGPIO FGPIOD /*!<@brief FGPIO device name: FGPIOD */
#define PINTOOL_MISC_LED_GREEN_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define PINTOOL_MISC_LED_GREEN_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_MISC_LED_GREEN_PIN 16U    /*!<@brief PORTD pin index: 16 */
                                          /* @} */

/*! @name PORTB11 (number 74), SW2
  @{ */
#define PINTOOL_MISC_SW2_FGPIO FGPIOB /*!<@brief FGPIO device name: FGPIOB */
#define PINTOOL_MISC_SW2_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define PINTOOL_MISC_SW2_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_MISC_SW2_PIN 11U    /*!<@brief PORTB pin index: 11 */
                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_Misc(void);

/*! @name PORTC6 (number 81), UART1_RX_TGTMCU
  @{ */
#define PINTOOL_LPUART_DEBUG_UART_RX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_LPUART_DEBUG_UART_RX_PIN 6U     /*!<@brief PORTC pin index: 6 */
                                                /* @} */

/*! @name PORTC7 (number 80), UART1_TX_TGTMCU
  @{ */
#define PINTOOL_LPUART_DEBUG_UART_TX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_LPUART_DEBUG_UART_TX_PIN 7U     /*!<@brief PORTC pin index: 7 */
                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_LPUART(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
